Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.org
#+title: \elzevier Measure Integration and Real Analysis
#+AUTHOR: Sheldon Axler \\
#+author: Notes taken by Dendy Li
#+CREATOR: Notes taken by Dendy Li

#+LATEX_HEADER: \input{~/Preamble/preamble.tex}
#+LATEX_COMPILER: xelatex

* Supplement of Measure, Integration and Real Analysis

** Sequencial Limit and Continuity of Functions
*** Continuity and Uniform Continuity
*General Convention: \(A \subseteq \R^m\)*

A good way to understand the continuity in place of the Epsilon-Delta language is to consider the sequeces limit. We have the relavant result here:

#+ATTR_LATEX: :options [Continuity via sequences]
#+BEGIN_proposition
Let \(f: A \to \R^n\) be a function. \(f\) is continuous at \(b\) iff every sequece \(\{a_k\}\) in \(A\) where \(\lim a_k = b\), then \(\lim f(a_k) = f(b)\).
#+END_proposition

Every sequence converges to some point in the domain, then the corresponding sequence in range converges to the corresponding point w.r.t. the limit point in the domain.

*** Maximum and Minimum
#+ATTR_LATEX: :options [Maximum and Minimum]
#+BEGIN_definition
For a set \( A \) given an order. \( \max A \) defined to be the "Greatest" element in the set \( A \); \( \min A \) defined to be the "Smallest" element in the set \( A \) w.r.t. the order.
#+END_definition

*Remark: Defference between \( \sup A \) and \( \max A\)*

Informally, \(\max A\) is the greatest element in the set where \(\sup A\) is the element which \(\max A\) want to become(It may become or might not).

#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Let \( A \subset \mathbb{R}^{m} \) be a closed and bounded set, \( f \) is a contunuous function on \( A \), then \( \max_A f, \min_A f \) exist.
#+END_proposition

#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode
- Showing \( \min_A f \) is the same as to show \( \max_A -f \). WLOG we only need to show one.
- Use closed and \( f \) continuous to show \(\max_A f\) exists.
- Use bounded to show we can take \(\max_A f\).
#+END_proof

#+ATTR_LATEX: :options [Image]
#+BEGIN_definition
Let \( A, B \) be sets, \(f:A\to B\) a function. If \(C \subseteq A\), then \(f(C) := \{f(x) \vert x \in C\}\) is the image of \(C\) under \(f\).
#+END_definition

#+ATTR_LATEX: :options [Image of closed and bounded set under continuous function is still closed and bounded]
#+BEGIN_proposition
Let \( A \) be a closed and bounded set of \(\mathbb{R}^{n}\), \(f: A \to \mathbb{R}^{n}\) is a continuous function. Then \(f(A)\) is a closed and bounded set of \(\mathbb{R}^{n}\).
#+END_proposition

#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode
- To show closed we show every sequecial limit lies in the set.
- To show bounded we show we can take max and min.
#+END_proof

* Recall of Riemann Integration
** Basic idea of Riemann Integration
- Partition of \([a,b]\): Turn \([a,b]\) into closed subintervals with "matched head and tail".

- Lower and upper Riemann sums: Once we have the partition and the notation of inf and sup of a function on some interval. We use inf to construct Riemann lower sum and sup for Riemann upper sum.

- Few facts for us to continue:
  + When partition goes finer, Upper sum goes smaller and lower sum goes larger.
  + Riemann upper sum \(\geq\) Riemann lower sum

- Define the Lower and upper riemann integrals repectively.(Forall Partition define sup Lower sum to be the lower Riemann integral and inf upper sum to be the upper riemann integral)

- Then it's natrual to define Riemann integral as follows:

#+ATTR_LATEX: :options [Riemann integrable and Riemann integral]
#+BEGIN_definition
A bounded function on a closed and bounded interval is Riemann integrable if its lower Riemann integral = upper Riemann integral and we use the notation
\[
\int^b_a f = \text{Lower integral} = \text{upper integral}
\]
where \(f:[a,b] \to \R\).
#+END_definition

** Basic Results of Riemann integral
#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Continuous real-valued function on closed bounded interval is Riemann integrable.
#+END_proposition

** Problems of Riemann integral
- Some functions want it to be integrable but not Riemann integrable.
- Interchanging sum and limit

* Outer Measure on R
*Different from the class, professor Tran use total measure to start, let's see what's the different.*

Motivation: We want to extend the class of integrable functions, which means we want to do integral on a more complicated intervals.

Now it comes to the basic idea: We need to associate a "size" to subsets of \(\R\).

Therefore we start with the basic ideas observed from the Riemann integral.

#+ATTR_LATEX: :options [Length of open interval]
#+BEGIN_definition
We defined the length of the interval to be the "Norm of the end point difference".
#+END_definition

Another non trivial observation is: if we represent an interval by a union of sequence of subsets, then length of this sequence = \(\Sigma\) length of every element in the sequence \(\leq\) length of the considered interval.

This arise the definition of the outer measure:

#+ATTR_LATEX: :options [Outer measure]
#+BEGIN_definition
Given \(A \subset \R\), we define the outer measure of \(A\) as follows:
\[
\vert A \vert = \inf \{\Sigma l(I_k) \vert I_ks \text{are open intervals}, A\subseteq \Cup I_k\}.
\]
#+END_definition

*Remark: We make a claim about the infinite sum, that is if some of the component in the sequence becomes \(\infty\), we say the sum is \(\infty\); if not this case, we consider the infinite sum as the limit of the increasing sequence sum(Since the length of the set is positive).*

** What is good about outer measure?
#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Every countable subset of \(\R\) has outer measure 0.
#+END_proposition

#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode

This basically because that the outer measure can shrink w.r.t. the "construction."
#+END_proof

eg. Suppose we have a countable set \(\{a_1,\dots,a_n\}\), for every element \(a_i\) we can find an interval \((a_i - \epsilon, a_i + \epsilon\), which covers the elements. The freedom the outer measure gives us is that we are allowed to change the value of the \(\epsilon\) to form an \epsilon sequence. By doing this we can "set" the measure of countable sets arbitrarily small.

#+ATTR_LATEX: :options [Outer measure preserves the order w.r.t. subset relation]
#+BEGIN_proposition
\(A,B\subseteq \R, A\subseteq B\). Then \(\vert A \vert \leq \vert B \vert\).
#+END_proposition


Translation is a geometric definition, It's always good to have the shape or size of the object we talk about somehow stay invariant under the translation.

#+ATTR_LATEX: :options [Translation]
#+BEGIN_definition
For \(t \in \R, A \in \R\), the translation \(t + A\) defined as follows:
\[
t + A := \{t + a \vert a \in A\},
\]
where this is just the definition for the coset.
#+END_definition

#+ATTR_LATEX: :options [Outer measure is translation invariant]
#+BEGIN_proposition
\(t \in \R, A \subseteq \R\), then \(\vert A \vert = \vert t + A \vert \).
#+END_proposition

#+ATTR_LATEX: :options [Countable subadditivity of outer measure]
#+BEGIN_proposition
Sum(Union) \(\le\) Sum(Sum).
#+END_proposition

