Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.tex
% Created 2024-11-12 Tue 23:09
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/Preamble/preamble.tex}
\author{Sheldon Axler \\
Notes taken by Dendy Li}
\date{\today}
\title{\elzevier Measure Integration and Real Analysis}
\hypersetup{
 pdfauthor={Sheldon Axler \\
Notes taken by Dendy Li},
 pdftitle={\elzevier Measure Integration and Real Analysis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Notes taken by Dendy Li}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Supplement of Measure, Integration and Real Analysis}
\label{sec:org46e16f4}

\subsection{Sequencial Limit and Continuity of Functions}
\label{sec:orgbcb1daf}
\subsubsection{Continuity and Uniform Continuity}
\label{sec:org69cc042}
\textbf{General Convention: \(A \subseteq \R^m\)}

A good way to understand the continuity in place of the Epsilon-Delta language is to consider the sequeces limit. We have the relavant result here:

\begin{proposition}[Continuity via sequences]
Let \(f: A \to \R^n\) be a function. \(f\) is continuous at \(b\) iff every sequece \(\{a_k\}\) in \(A\) where \(\lim a_k = b\), then \(\lim f(a_k) = f(b)\).
\end{proposition}

Every sequence converges to some point in the domain, then the corresponding sequence in range converges to the corresponding point w.r.t. the limit point in the domain.
\subsubsection{Maximum and Minimum}
\label{sec:org3fb5d02}
\begin{definition}[Maximum and Minimum]
For a set \(A\) given an order. \(\max A\) defined to be the ``Greatest'' element in the set \(A\); \(\min A\) defined to be the ``Smallest'' element in the set \(A\) w.r.t. the order.
\end{definition}

\textbf{Remark: Defference between \(\sup A\) and \(\max A\)}

Informally, \(\max A\) is the greatest element in the set where \(\sup A\) is the element which \(\max A\) want to become(It may become or might not).

\begin{proposition}[ ]
Let \(A \subset \mathbb{R}^{m}\) be a closed and bounded set, \(f\) is a contunuous function on \(A\), then \(\max_A f, \min_A f\) exist.
\end{proposition}

\begin{proof}[Proof Sketch]
\leavevmode
\begin{itemize}
\item Showing \(\min_A f\) is the same as to show \(\max_A -f\). WLOG we only need to show one.
\item Use closed and \(f\) continuous to show \(\max_A f\) exists.
\item Use bounded to show we can take \(\max_A f\).
\end{itemize}
\end{proof}

\begin{definition}[Image]
Let \(A, B\) be sets, \(f:A\to B\) a function. If \(C \subseteq A\), then \(f(C) := \{f(x) \vert x \in C\}\) is the image of \(C\) under \(f\).
\end{definition}

\begin{proposition}[Image of closed and bounded set under continuous function is still closed and bounded]
Let \(A\) be a closed and bounded set of \(\mathbb{R}^{n}\), \(f: A \to \mathbb{R}^{n}\) is a continuous function. Then \(f(A)\) is a closed and bounded set of \(\mathbb{R}^{n}\).
\end{proposition}

\begin{proof}[Proof Sketch]
\leavevmode
\begin{itemize}
\item To show closed we show every sequecial limit lies in the set.
\item To show bounded we show we can take max and min.
\end{itemize}
\end{proof}
\section{Recall of Riemann Integration}
\label{sec:orgdf228c8}
\subsection{Basic idea of Riemann Integration}
\label{sec:orge1b29eb}
\begin{itemize}
\item Partition of \([a,b]\): Turn \([a,b]\) into closed subintervals with ``matched head and tail''.

\item Lower and upper Riemann sums: Once we have the partition and the notation of inf and sup of a function on some interval. We use inf to construct Riemann lower sum and sup for Riemann upper sum.

\item Few facts for us to continue:
\begin{itemize}
\item When partition goes finer, Upper sum goes smaller and lower sum goes larger.
\item Riemann upper sum \(\geq\) Riemann lower sum
\end{itemize}

\item Define the Lower and upper riemann integrals repectively.(Forall Partition define sup Lower sum to be the lower Riemann integral and inf upper sum to be the upper riemann integral)

\item Then it's natrual to define Riemann integral as follows:
\end{itemize}

\begin{definition}[Riemann integrable and Riemann integral]
A bounded function on a closed and bounded interval is Riemann integrable if its lower Riemann integral = upper Riemann integral and we use the notation
\[
\int^b_a f = \text{Lower integral} = \text{upper integral}
\]
where \(f:[a,b] \to \R\).
\end{definition}
\subsection{Basic Results of Riemann integral}
\label{sec:org842b607}
\begin{proposition}[ ]
Continuous real-valued function on closed bounded interval is Riemann integrable.
\end{proposition}
\subsection{Problems of Riemann integral}
\label{sec:org343bb29}
\begin{itemize}
\item Some functions want it to be integrable but not Riemann integrable.
\item Interchanging sum and limit
\end{itemize}
\section{Outer Measure on R}
\label{sec:org48c4386}
\textbf{Different from the class, professor Tran use total measure to start, let's see what's the different.}

Motivation: We want to extend the class of integrable functions, which means we want to do integral on a more complicated intervals.

Now it comes to the basic idea: We need to associate a ``size'' to subsets of \(\R\).

Therefore we start with the basic ideas observed from the Riemann integral.

\begin{definition}[Length of open interval]
We defined the length of the interval to be the ``Norm of the end point difference''.
\end{definition}

Another non trivial observation is: if we represent an interval by a union of sequence of subsets, then length of this sequence = \(\Sigma\) length of every element in the sequence \(\leq\) length of the considered interval.

This arise the definition of the outer measure:

\begin{definition}[Outer measure]
Given \(A \subset \R\), we define the outer measure of \(A\) as follows:
\[
\vert A \vert = \inf \{\Sigma l(I_k) \vert I_ks \text{are open intervals}, A\subseteq \Cup I_k\}.
\]
\end{definition}

\textbf{Remark: We make a claim about the infinite sum, that is if some of the component in the sequence becomes \(\infty\), we say the sum is \(\infty\); if not this case, we consider the infinite sum as the limit of the increasing sequence sum(Since the length of the set is positive).}
\subsection{What is good about outer measure?}
\label{sec:org250af30}
\begin{proposition}[ ]
Every countable subset of \(\R\) has outer measure 0.
\end{proposition}

\begin{proof}[Proof Sketch]
\leavevmode

This basically because that the outer measure can shrink w.r.t. the ``construction.''
\end{proof}

eg. Suppose we have a countable set \(\{a_1,\dots,a_n\}\), for every element \(a_i\) we can find an interval \((a_i - \epsilon, a_i + \epsilon\), which covers the elements. The freedom the outer measure gives us is that we are allowed to change the value of the \(\epsilon\) to form an \(\epsilon\) sequence. By doing this we can ``set'' the measure of countable sets arbitrarily small.

\begin{proposition}[Outer measure preserves the order w.r.t. subset relation]
\(A,B\subseteq \R, A\subseteq B\). Then \(\vert A \vert \leq \vert B \vert\).
\end{proposition}


Translation is a geometric definition, It's always good to have the shape or size of the object we talk about somehow stay invariant under the translation.

\begin{definition}[Translation]
For \(t \in \R, A \in \R\), the translation \(t + A\) defined as follows:
\[
t + A := \{t + a \vert a \in A\},
\]
where this is just the definition for the coset.
\end{definition}

\begin{proposition}[Outer measure is translation invariant]
\(t \in \R, A \subseteq \R\), then \(\vert A \vert = \vert t + A \vert\).
\end{proposition}

\begin{proposition}[Countable subadditivity of outer measure]
Sum(Union) \(\le\) Sum(Sum).
\end{proposition}
