Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.org
** Outer measure of closed bounded interval
Next we focused on the always fansinating interval-closed an bounded interval. We have the following result:
#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
For \(a,b \in \R, a < b\), we have:
\[
\vert [a,b] \vert = b - a.
\]
#+END_proposition

#+ATTR_LATEX: :options [Open cover; finite subcover of A]
#+BEGIN_definition
Let \(A \subseteq \R\), we have the following convention:
- Collection \(\mathcal{C}\) is a open cover of \(A\) if every set of \(\mathcal{C}\) is an open set and \(A \subset \Cup \mathcal{C}\).

- Cover \(\mathcal{C}\) have a subcover \(\mathcal{C}_s\) of \(A\), if \(\mathcal{C}_s\) is a cover of \(A\), also a subset of \(\mathcal{C}\).
#+END_definition

Now we come to a very important result:
#+ATTR_LATEX: :options [Heine-Borel Theorem]
#+BEGIN_theorem
In \(\R\), every open cover of a closed and bounded set in \(\R\) has a finite subcover.
#+END_theorem

#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode
- \(\vert [a,b] \vert \ge b - a\)
- \(\vert [a,b] \vert \le b - a\)
#+END_proof

Next is a result about the natural intuition on the intervals in \(\R\), which is also a corollary of the Heine-Borel theorem.

#+ATTR_LATEX: :options [Non trivial intervals are uncountable]
#+BEGIN_proposition
Every intervals in \(\R\) has two distinct elements are uncountable.
#+END_proposition

** Problems on outer measure
*The main porblems on outer measure is that the outer measure isn't additive, it is subadditive.*

#+ATTR_LATEX: :options [Nonadditivity of outer measure]
#+BEGIN_proposition
Disjoint subsets \(A,B\subseteq \R\) doesn't satify the following identity:
\[
\vert A \cup B \vert \neq \vert A \vert + \vert B \vert.
\]
#+END_proposition

The proof isn't very trivial and also involves the AC. But in class I remember that prof. Tran has given a hint on not using AC, need to be clear.



* Measurable Spaces and Functions
*In this chapter we modified the definition of the non-additivity of outer measure and try to works with the "better notation"\(\sigma\)-algebra.*

** sigma algebra and measurable space
# Justp Simply avoid using math symbols in title.

The motivation question is that: Can we simply force outer measure to hace additivity by change the notation and adding this rules?

Notice we have the following proposition:

#+ATTR_LATEX: :options [Nonexistence of such notation to all subsets of \(\R\)]
#+BEGIN_proposition
The following properties can't exist for some function \(\mu\) at the same time:
- \(\mu:P(\R) \to [0,\infty] \)
- For all interval \(I\) of \(\R\), \(\mu(I) = length(I)\).
- Countable additivity
- Translation invariant
#+END_proposition

We need to do some choice to weaker the notion above. But it seems like the only reasonable way to do it just don't define \(\mu\) on \(P\R\). Thus we have the notion of \(\sigma\)-algebra.

#+ATTR_LATEX: :options [\(\sigma\)-algebra]
#+BEGIN_definition
Let \(X\) be a set and \(S\) be a set of subsets of \(X\). \(S\) is a \(\sigma\)-algebra if it satisfies the following properties:
- \(\emptyset \in S\);
- closed under complement;
- closed under countable union.
#+END_definition


*Remark:*
  - *Here \(P(\R)\) denote the power set of \(\R\).*
  - *By D'Morgan law, one can easily deduce that \(\sigma\)-algebra is closed under countable intersection.*


With the notation given above, we simply want the elements in \(\sigma\)-algebra to be the elements which can be measurable and in this convention we want this notation works well with other notations.

#+ATTR_LATEX: :options [Measurable space and measurable set]
#+BEGIN_definition
- Measurable space is a set \(X\) with \(\sigma\)-algebra \(S\) on. this set being declared.
- \(U \in S\) is called an \(S\)-measurable set.
#+END_definition

