Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.tex
\subsection{Outer measure of closed bounded interval}
\label{sec:org8b52ff1}
Next we focused on the always fansinating interval-closed an bounded interval. We have the following result:
\begin{proposition}[ ]
For \(a,b \in \R, a < b\), we have:
\[
\vert [a,b] \vert = b - a.
\]
\end{proposition}

\begin{definition}[Open cover; finite subcover of A]
Let \(A \subseteq \R\), we have the following convention:
\begin{itemize}
\item Collection \(\mathcal{C}\) is a open cover of \(A\) if every set of \(\mathcal{C}\) is an open set and \(A \subset \Cup \mathcal{C}\).

\item Cover \(\mathcal{C}\) have a subcover \(\mathcal{C}_s\) of \(A\), if \(\mathcal{C}_s\) is a cover of \(A\), also a subset of \(\mathcal{C}\).
\end{itemize}
\end{definition}

Now we come to a very important result:
\begin{theorem}[Heine-Borel Theorem]
In \(\R\), every open cover of a closed and bounded set in \(\R\) has a finite subcover.
\end{theorem}

\begin{proof}[Proof Sketch]
\leavevmode
\begin{itemize}
\item \(\vert [a,b] \vert \ge b - a\)
\item \(\vert [a,b] \vert \le b - a\)
\end{itemize}
\end{proof}

Next is a result about the natural intuition on the intervals in \(\R\), which is also a corollary of the Heine-Borel theorem.

\begin{proposition}[Non trivial intervals are uncountable]
Every intervals in \(\R\) has two distinct elements are uncountable.
\end{proposition}
\subsection{Problems on outer measure}
\label{sec:org9248923}
\textbf{The main porblems on outer measure is that the outer measure isn't additive, it is subadditive.}

\begin{proposition}[Nonadditivity of outer measure]
Disjoint subsets \(A,B\subseteq \R\) doesn't satify the following identity:
\[
\vert A \cup B \vert \neq \vert A \vert + \vert B \vert.
\]
\end{proposition}

The proof isn't very trivial and also involves the AC. But in class I remember that prof. Tran has given a hint on not using AC, need to be clear.
\section{Measurable Spaces and Functions}
\label{sec:orgd41ff58}
\textbf{In this chapter we modified the definition of the non-additivity of outer measure and try to works with the ``better notation''\(\sigma\)-algebra.}
\subsection{sigma algebra and measurable space}
\label{sec:orgebf4dee}
The motivation question is that: Can we simply force outer measure to hace additivity by change the notation and adding this rules?

Notice we have the following proposition:

\begin{proposition}[Nonexistence of such notation to all subsets of \(\R\)]
The following properties can't exist for some function \(\mu\) at the same time:
\begin{itemize}
\item \(\mu:P(\R) \to [0,\infty]\)
\item For all interval \(I\) of \(\R\), \(\mu(I) = length(I)\).
\item Countable additivity
\item Translation invariant
\end{itemize}
\end{proposition}

We need to do some choice to weaker the notion above. But it seems like the only reasonable way to do it just don't define \(\mu\) on \(P\R\). Thus we have the notion of \(\sigma\)-algebra.

\begin{definition}[\(\sigma\)-algebra]
Let \(X\) be a set and \(S\) be a set of subsets of \(X\). \(S\) is a \(\sigma\)-algebra if it satisfies the following properties:
\begin{itemize}
\item \(\emptyset \in S\);
\item closed under complement;
\item closed under countable union.
\end{itemize}
\end{definition}


\textbf{Remark:}
\begin{itemize}
\item \textbf{Here \(P(\R)\) denote the power set of \(\R\).}
\item \textbf{By D'Morgan law, one can easily deduce that \(\sigma\)-algebra is closed under countable intersection.}
\end{itemize}


With the notation given above, we simply want the elements in \(\sigma\)-algebra to be the elements which can be measurable and in this convention we want this notation works well with other notations.

\begin{definition}[Measurable space and measurable set]
\begin{itemize}
\item Measurable space is a set \(X\) with \(\sigma\)-algebra \(S\) on. this set being declared.
\item \(U \in S\) is called an \(S\)-measurable set.
\end{itemize}
\end{definition}
