Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.org
** Borel Subsets of R

#+ATTR_LATEX: :options [Top-Down definition of \(\sigma\)-algebra generated by a set of sets]
#+BEGIN_definition
Let \(X\) be a set \(\A\) is a set of subsets of \(X\). Then the \(\sigma\)-algebra generated by \(X\) is the intersection of all \(\sigma\)-algebra on \(X\) containing \(\A\).
#+END_definition

*Remark: Since the power set of \(X\) is a \(\sigma\)-algebra, so such intersection is valid.*

#+ATTR_LATEX: :options [Borel set]
#+BEGIN_definition
The \(\sigma\)-algebra generated by all open subsets of \(\R\) is called the Borel algebra. An element of Borel algebra is called the Borel set.
#+END_definition

Since every one sets of \(\R\) is is the union of a sequence of open intervals, the defintion of Borel algebra can be modified a little bit to "generated by all open intervals".

*Examples of Borerl sets:*
+ Directly by definition of \(\sigma\)-algebra:
  + Every closed subset of \(\R\).
  + Every countable subset of \(\R\).
+ Representation by countable union:
  + Every half-open interval.
  + Set of continuous points of a function on \(\R\).

*Here we meet a question: \(a\) doesn't lies in any of the intervals in the intersection of the intervals, how can \([a,b] = \cap^{\infty}_{k = 1}(a-\frac{1}{k}, b\).*

Oh I look at the condition wrong, it is \(a-\frac{1}{k}\) not \(a + \frac{1}{k}\). Limit notation and the inclusion relationship still doesn't change.

#+ATTR_LATEX: :options [Inverse image]
#+BEGIN_definition
Let \(f:X \to Y\) is a function, \(A\subseteq Y\), then define:
\[
f^{-1}(A) := \{x \in X \vert f(x) \in A\}.
\]
#+END_definition

#+ATTR_LATEX: :options [Algerba of inverse image]
#+BEGIN_proposition
Let \(f:X \to Y\) is a function, we have the following properties:
- Inverse image intersect with \.
- Inverse image intersect with union.
- Inverse image intersect with intersection.
#+END_proposition

#+ATTR_LATEX: :options [Inverse image of a composition]
#+BEGIN_proposition
Let \(g,f\) be functions satitfies the condition of composition, \(A\) is a subset of the image of the composition. Then we have the following identity:
\[
(g \circ f)^{-1}(A) = f^{-1}(g^{-1}(A))
\]
#+END_proposition

Now we come to an important notation: Measurable function.

*If we can define measurable function here, why we still need lebesgue measure in order to do the integration?*

#+ATTR_LATEX: :options [Measurable function]
#+BEGIN_definition
Let \((X,S)\) be a measurable space, \(B\) a borel set. \(f:X \to \R\) is measurable(When \(S\) is clear from the text) if
\[
f^{-1} (B) \in S.
\]
#+END_definition

#+ATTR_LATEX: :options [Characteristic function]
#+BEGIN_definition
Characteristic function of a set \(E\), is a "Mark", tells you an element in \(E\) with output \(1\), and not in \(E\) with output \(0\).
#+END_definition

Characteristic function of \(E\) has an interesting property to express the sets related to \(E\), we express it by the following proposition:

#+ATTR_LATEX: :options [Inverse image of characteristic funcion]
#+BEGIN_proposition
Let \(B\subseteq \R\), then one of the following case stands for \(\chi_E^{-1} (B)\):
- \(E \ 1 \in B, 0 \notin B\);
- \(X \ 1 \in B, 0 \in B\);
- \(X / E \ 1 notin B, 0 \in B\);
- \(\emptyset \ 1 \notin B, 0 \notin B\).
#+END_proposition

#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
\(\chi_E\) is a measurable function iff \(E \in S\).
#+END_proposition

#+ATTR_LATEX: :options [Measurable function]
#+BEGIN_proposition
By the convention we use, \(f:X \to \R\) is a function, s.t.
\[
f^{-1} ((a,\infty)) \ \in S \ \forall a \in \R
\]
Then \(f\) is measurable.
#+END_proposition

*This proposition is useful to show some function defined on a borel subset is measurable.*

#+ATTR_LATEX: :options [Proof Sketch]
#+BEGIN_proof
\leavevmode

We check the definition of measurable function to prove the result.

We can modify a little bit to show that every borel set can be represented by \((a,\infty)\) and the set contains all such interval is a sigma algebra(Then we prove this is actually the borel algebra).
#+END_proof

By restricting the definition of measurable function to borel subset of \(\R\), we have the following convention:

#+ATTR_LATEX: :options [Borel measurable function]
#+BEGIN_definition
Let \(X \subseteq \R\), \(B\) is any borel subset of \(\R\). \(f:X \to \R\) is borel measurable if
\[
f^{-1}(B) \in S.
\]
#+END_definition

*To judge a function is \(S\)- measurable or not we only look at if the inverse image of borel set lies in \(S\) or not.*

#+ATTR_LATEX: :options [Continuous functions are borel measurable]
#+BEGIN_proposition
Let \(B\) be a borel subset of \(\R\), then \(f:B \to \R\) is a borel measurable function if \(f\) is a continuous funcion.
#+END_proposition

#+ATTR_LATEX: :options [Increasing function]
#+BEGIN_definition
Let \(X \subseteq \R\), \(f:X \to \R\):
- \(f\) strictly increasing if \(f(x) < f(y)\) for all \(x < y\).
- \(f\) increasing if \(f(x) \leq f(y)\) for all \(x < y\).
#+END_definition

#+ATTR_LATEX: :options [Increasing functions are borel measurable]
#+BEGIN_proposition

#+END_proposition
* Measures and corresponding properties
** Measure
*Motivation: The definition of Measure comes from extending the definition of Length of an interval.*

#+ATTR_LATEX: :options [Measure]
#+BEGIN_definition
Let \(X\) be a set and \(S\) a \(\sigma\)-algebra on \(X\). A measure on \((X,S)\) is a function \(\mu: S \to [0,\infty]\), s.t. \(\mu (\emptyset) = 0\) and
\[
\mu (\cup_{k = 1}^{\infty} E_{k}) = \sum_{k = 1}^{\infty} \mu(E_k),
\]
where \((E_k)\) is a disjoint sequence in \(S\).
#+END_definition

#+ATTR_LATEX: :options [Measure space]
#+BEGIN_definition
\((X,S)\) together with a defined measure is called measure space.
#+END_definition

** Properties of measure
#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Measure preserves the subset relation and the set different is represented by subtraction of measure.
#+END_proposition

#+ATTR_LATEX: :options [ ]
#+BEGIN_proposition
Measure has countable subadditivity for the non-restrict disjoint sequence in the \(\sigma\)-algebra.
#+END_proposition

#+ATTR_LATEX: :options [Interchange of limit and sum when increasing union]
#+BEGIN_proposition
Let \((X,S,\mu)\) be a measure space and \(E_1 \subseteq E_2 \subseteq \dots\) is an increasing sequence of sets in \(S\). Then the measure of the union of the sequence is the limit of \(\mu(E_k)\) when \(k \to \infty\).
#+END_proposition

*Remark: The property above also works for a decreasing sequence(The "largest element" has finite measure) with intersecion.*

#+ATTR_LATEX: :options [Measure of a union]
#+BEGIN_proposition
The following identity holds for finite measure:
\[
\mu(D\cup E) = \mu(D) + \mu(E) - \mu(D\cap E)
\]
#+END_proposition

