Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.tex
\subsection{Borel Subsets of R}
\label{sec:org6edaa26}

\begin{definition}[Top-Down definition of \(\sigma\)-algebra generated by a set of sets]
Let \(X\) be a set \(\A\) is a set of subsets of \(X\). Then the \(\sigma\)-algebra generated by \(X\) is the intersection of all \(\sigma\)-algebra on \(X\) containing \(\A\).
\end{definition}

\textbf{Remark: Since the power set of \(X\) is a \(\sigma\)-algebra, so such intersection is valid.}

\begin{definition}[Borel set]
The \(\sigma\)-algebra generated by all open subsets of \(\R\) is called the Borel algebra. An element of Borel algebra is called the Borel set.
\end{definition}

Since every one sets of \(\R\) is is the union of a sequence of open intervals, the defintion of Borel algebra can be modified a little bit to ``generated by all open intervals''.

\textbf{Examples of Borerl sets:}
\begin{itemize}
\item Directly by definition of \(\sigma\)-algebra:
\begin{itemize}
\item Every closed subset of \(\R\).
\item Every countable subset of \(\R\).
\end{itemize}
\item Representation by countable union:
\begin{itemize}
\item Every half-open interval.
\item Set of continuous points of a function on \(\R\).
\end{itemize}
\end{itemize}

\textbf{Here we meet a question: \(a\) doesn't lies in any of the intervals in the intersection of the intervals, how can \([a,b] = \cap^{\infty}_{k = 1}(a-\frac{1}{k}, b\).}

Oh I look at the condition wrong, it is \(a-\frac{1}{k}\) not \(a + \frac{1}{k}\). Limit notation and the inclusion relationship still doesn't change.

\begin{definition}[Inverse image]
Let \(f:X \to Y\) is a function, \(A\subseteq Y\), then define:
\[
f^{-1}(A) := \{x \in X \vert f(x) \in A\}.
\]
\end{definition}

\begin{proposition}[Algerba of inverse image]
Let \(f:X \to Y\) is a function, we have the following properties:
\begin{itemize}
\item Inverse image intersect with $\backslash$.
\item Inverse image intersect with union.
\item Inverse image intersect with intersection.
\end{itemize}
\end{proposition}

\begin{proposition}[Inverse image of a composition]
Let \(g,f\) be functions satitfies the condition of composition, \(A\) is a subset of the image of the composition. Then we have the following identity:
\[
(g \circ f)^{-1}(A) = f^{-1}(g^{-1}(A))
\]
\end{proposition}

Now we come to an important notation: Measurable function.

\textbf{If we can define measurable function here, why we still need lebesgue measure in order to do the integration?}

\begin{definition}[Measurable function]
Let \((X,S)\) be a measurable space, \(B\) a borel set. \(f:X \to \R\) is measurable(When \(S\) is clear from the text) if
\[
f^{-1} (B) \in S.
\]
\end{definition}

\begin{definition}[Characteristic function]
Characteristic function of a set \(E\), is a ``Mark'', tells you an element in \(E\) with output \(1\), and not in \(E\) with output \(0\).
\end{definition}

Characteristic function of \(E\) has an interesting property to express the sets related to \(E\), we express it by the following proposition:

\begin{proposition}[Inverse image of characteristic funcion]
Let \(B\subseteq \R\), then one of the following case stands for \(\chi_E^{-1} (B)\):
\begin{itemize}
\item \(E \ 1 \in B, 0 \notin B\);
\item \(X \ 1 \in B, 0 \in B\);
\item \(X / E \ 1 notin B, 0 \in B\);
\item \(\emptyset \ 1 \notin B, 0 \notin B\).
\end{itemize}
\end{proposition}

\begin{proposition}[ ]
\(\chi_E\) is a measurable function iff \(E \in S\).
\end{proposition}

\begin{proposition}[Measurable function]
By the convention we use, \(f:X \to \R\) is a function, s.t.
\[
f^{-1} ((a,\infty)) \ \in S \ \forall a \in \R
\]
Then \(f\) is measurable.
\end{proposition}

\textbf{This proposition is useful to show some function defined on a borel subset is measurable.}

\begin{proof}[Proof Sketch]
\leavevmode

We check the definition of measurable function to prove the result.

We can modify a little bit to show that every borel set can be represented by \((a,\infty)\) and the set contains all such interval is a sigma algebra(Then we prove this is actually the borel algebra).
\end{proof}

By restricting the definition of measurable function to borel subset of \(\R\), we have the following convention:

\begin{definition}[Borel measurable function]
Let \(X \subseteq \R\), \(B\) is any borel subset of \(\R\). \(f:X \to \R\) is borel measurable if
\[
f^{-1}(B) \in S.
\]
\end{definition}

\textbf{To judge a function is \(S\)- measurable or not we only look at if the inverse image of borel set lies in \(S\) or not.}

\begin{proposition}[Continuous functions are borel measurable]
Let \(B\) be a borel subset of \(\R\), then \(f:B \to \R\) is a borel measurable function if \(f\) is a continuous funcion.
\end{proposition}

\begin{definition}[Increasing function]
Let \(X \subseteq \R\), \(f:X \to \R\):
\begin{itemize}
\item \(f\) strictly increasing if \(f(x) < f(y)\) for all \(x < y\).
\item \(f\) increasing if \(f(x) \leq f(y)\) for all \(x < y\).
\end{itemize}
\end{definition}

\begin{proposition}[Increasing functions are borel measurable]

\end{proposition}
\section{Measures and corresponding properties}
\label{sec:org71d6d03}
\subsection{Measure}
\label{sec:org23c60be}
\textbf{Motivation: The definition of Measure comes from extending the definition of Length of an interval.}

\begin{definition}[Measure]
Let \(X\) be a set and \(S\) a \(\sigma\)-algebra on \(X\). A measure on \((X,S)\) is a function \(\mu: S \to [0,\infty]\), s.t. \(\mu (\emptyset) = 0\) and
\[
\mu (\cup_{k = 1}^{\infty} E_{k}) = \sum_{k = 1}^{\infty} \mu(E_k),
\]
where \((E_k)\) is a disjoint sequence in \(S\).
\end{definition}

\begin{definition}[Measure space]
\((X,S)\) together with a defined measure is called measure space.
\end{definition}
\subsection{Properties of measure}
\label{sec:orgac5e90b}
\begin{proposition}[ ]
Measure preserves the subset relation and the set different is represented by subtraction of measure.
\end{proposition}

\begin{proposition}[ ]
Measure has countable subadditivity for the non-restrict disjoint sequence in the \(\sigma\)-algebra.
\end{proposition}

\begin{proposition}[Interchange of limit and sum when increasing union]
Let \((X,S,\mu)\) be a measure space and \(E_1 \subseteq E_2 \subseteq \dots\) is an increasing sequence of sets in \(S\). Then the measure of the union of the sequence is the limit of \(\mu(E_k)\) when \(k \to \infty\).
\end{proposition}

\textbf{Remark: The property above also works for a decreasing sequence(The ``largest element'' has finite measure) with intersecion.}

\begin{proposition}[Measure of a union]
The following identity holds for finite measure:
\[
\mu(D\cup E) = \mu(D) + \mu(E) - \mu(D\cap E)
\]
\end{proposition}
