Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.org
** Lebesgue Measure
Outer measure only have subadditivity, we can change it to additivity if we restrict one of the sets to be open, thus we have the following proposition:

#+ATTR_LATEX: :options [Additivity for outer measure if open]
#+BEGIN_proposition
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) open. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
#+END_proposition

#+ATTR_LATEX: :options [Additivity for outer measure if closed]
#+BEGIN_proposition
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) closed. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
#+END_proposition

Now one can image if the following result also holds for one set is a borel set. Fortunately we have the following result:
#+ATTR_LATEX: :options [Additivity for outer measure if borel]
#+BEGIN_proposition
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) borel. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
#+END_proposition

The result above comes from the following proposition:
#+ATTR_LATEX: :options [Borel set approximation from below by closed sets]
#+BEGIN_proposition
Suppose \(B\) a Borel set. Then \(\forall \epsilon > 0 \ \exists G\) closed, such that \(\vert B \ G\vert < \epsilon \).
#+END_proposition

This proposition basically tells us Borel set can be arbitrarily closed to a closed set.

*Why we care about this approximation? Is borel set not good enough to describe the behaviour of \(\R\)?*

The answer is YES!

#+ATTR_LATEX: :options [Existence of a subset of \(\R\) which is not a borel set]
#+BEGIN_proposition
The contra-example comes from the nonadditivity of outer measure.
#+END_proposition

#+ATTR_LATEX: :options [Outer measure restrict on borel sets in a measure]
#+BEGIN_proposition
Outer measure on \((\R,\mathcal{B})\) is a measure, where \(\mathcal{B}\) refers to the Borel algebra.
#+END_proposition

Now we come to the most important definition of measure theory.

#+ATTR_LATEX: :options [Lebesgue measure]
#+BEGIN_definition
Lebesgue measure is the measure on \((\R,\mathcal{B}\), assigns to each Borel set its outer measure.
#+END_definition

*Remark: Lebesgue measure is the same as outer measure restrict on the Borel sets.*

#+ATTR_LATEX: :options [Lebesgue measurable]
#+BEGIN_definition
We say a set is Lebesgue measurable if there exists a Borel set and the set difference of the two sets is "0" w.r.t. outer measure.
#+END_definition

*This characterization tells us Lebesgue measurable set is very close to a Borel set in outer measure sense.*

* Integration with respect to a Measure

#+ATTR_LATEX: :options [\(S\)-partition]
#+BEGIN_definition
For a given set \(X\), let \(S\) be a \(\sigma\)-algebra on \(X\). An \(S\)-partition of \(X\) is a finite collection of disjoint sets such that their union is \(X\).
#+END_definition

In the sense of \(\R\), the \(S\)-partition can form very strange intervals instead of the "Standard" partition we give in Riemann integral.

Once we define the partition one thing we can do is to "sum".

#+ATTR_LATEX: :options [Lower Lebesgue Sum]
#+BEGIN_definition

#+END_definition

* Lp-Space

#+ATTR_LATEX: :options [\(L^p\) space is a vector space]
#+BEGIN_proposition
\(L^p\)-space is a vector space by the triangle equality of the norm, i.e. norm of two elements' sum is less than sum of the norms of element, whcih implies finite norm.
#+END_proposition
