Analysis/MeasureIntegrationAndRealAnalysis/MeasureIntegrationRealAnalysis.tex
\subsection{Lebesgue Measure}
\label{sec:org1d92167}
Outer measure only have subadditivity, we can change it to additivity if we restrict one of the sets to be open, thus we have the following proposition:

\begin{proposition}[Additivity for outer measure if open]
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) open. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
\end{proposition}

\begin{proposition}[Additivity for outer measure if closed]
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) closed. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
\end{proposition}

Now one can image if the following result also holds for one set is a borel set. Fortunately we have the following result:
\begin{proposition}[Additivity for outer measure if borel]
Let \(A,G \subseteq \R\) are disjoint subsets with \(G\) borel. Then
\[
\vert A \cup G \vert = \vert A \vert + \vert G \vert.
\]
\end{proposition}

The result above comes from the following proposition:
\begin{proposition}[Borel set approximation from below by closed sets]
Suppose \(B\) a Borel set. Then \(\forall \epsilon > 0 \ \exists G\) closed, such that \(\vert B \ G\vert < \epsilon\).
\end{proposition}

This proposition basically tells us Borel set can be arbitrarily closed to a closed set.

\textbf{Why we care about this approximation? Is borel set not good enough to describe the behaviour of \(\R\)?}

The answer is YES!

\begin{proposition}[Existence of a subset of \(\R\) which is not a borel set]
The contra-example comes from the nonadditivity of outer measure.
\end{proposition}

\begin{proposition}[Outer measure restrict on borel sets in a measure]
Outer measure on \((\R,\mathcal{B})\) is a measure, where \(\mathcal{B}\) refers to the Borel algebra.
\end{proposition}

Now we come to the most important definition of measure theory.

\begin{definition}[Lebesgue measure]
Lebesgue measure is the measure on \((\R,\mathcal{B}\), assigns to each Borel set its outer measure.
\end{definition}

\textbf{Remark: Lebesgue measure is the same as outer measure restrict on the Borel sets.}

\begin{definition}[Lebesgue measurable]
We say a set is Lebesgue measurable if there exists a Borel set and the set difference of the two sets is ``0'' w.r.t. outer measure.
\end{definition}

\textbf{This characterization tells us Lebesgue measurable set is very close to a Borel set in outer measure sense.}
\section{Integration with respect to a Measure}
\label{sec:org625ede7}

\begin{definition}[\(S\)-partition]
For a given set \(X\), let \(S\) be a \(\sigma\)-algebra on \(X\). An \(S\)-partition of \(X\) is a finite collection of disjoint sets such that their union is \(X\).
\end{definition}

In the sense of \(\R\), the \(S\)-partition can form very strange intervals instead of the ``Standard'' partition we give in Riemann integral.

Once we define the partition one thing we can do is to ``sum''.

\begin{definition}[Lower Lebesgue Sum]

\end{definition}
\section{Lp-Space}
\label{sec:orgc5365a6}

\begin{proposition}[\(L^p\) space is a vector space]
\(L^p\)-space is a vector space by the triangle equality of the norm, i.e. norm of two elements' sum is less than sum of the norms of element, whcih implies finite norm.
\end{proposition}
\end{document}
